<a href="https://colab.research.google.com/github/sutejym122/Data-Science-and-Machine-Learning-/blob/main/Task10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Task 10**

**Name** : Sutej y m

**GO_STP_10487**

**1.What is Nominal Variables ?**

Nominal data simply names something without assigning it to an order in relation to other numbered objects or pieces of data. • An example of nominal data might be a “pass” or “fail” classification for each student’s test result. Nominal data provides some information about a group or set of events, even if that information is limited to mere counts.

**2.What is Ordinal Variables ?**

Ordinal data, unlike nominal data, involves some order; ordinal numbers stand in relation to each other in a ranked fashion. • For example, suppose you receive a survey from your favorite restaurant that asks you to provide feedback on the service you received. You can rank the quality of service as “1” for poor, “2” for below average, “3” for average, “4” for very good and “5” for excellent. The data collected by this survey are examples of ordinal data. Here the numbers assigned have an order or rank; that is, a ranking of “4” is better than a ranking of “2.”

**3.Discuss about Multicollinearity and Dummy Variable Trap?**

Dummy Variable Trap as the outcome of one variable can easily be predicted with the help of the remaining variables. • Dummy Variable Trap is a scenario in which variables are highly correlated to each other. • The Dummy Variable Trap leads to the problem known as Multicollinearity. Multicollinearity occurs where there is a dependency between the independent features. • Multicollinearity is a serious issue in machine learning models like Linear Regression and Logistic Regression. • So, in order to overcome the problem of multicollinearity, one of the dummy variables has to be dropped.

**4.OneHotEncoder()**

One hot encoding is a process of converting categorical data variables. So they can be provided to machine learning algorithms to improve predictions. One hot encoding is a crucial part of feature engineering for machine learning. The input to this transformer should be an array-like of integers or strings, denoting the values taken on by categorical (discrete) features. The features are encoded using a one-hot (aka ‘one-of-K’ or ‘dummy’) encoding scheme. This creates a binary column for each category and returns a sparse matrix or dense array (depending on the sparse parameter). By default, the encoder derives the categories based on the unique values in each feature. Alternatively, you can also specify the categories manually.

**5.get_dummies()**

pandas.get_dummies() is used for data manipulation.It converts categorical data into dummy or indicator variables

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import sklearn

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [ ]:
data = pd.read_csv('salary.csv',delim_whitespace=True)
data.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [ ]:
print(data.size)
print(data.shape)
print(data.describe())
print(data.dtypes)

312
(52, 6)
              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000
sx    object
rk    object
yr     int64
dg    object
yd     int64
sl     int64
dtype: object

In [ ]:
data2 = pd.get_dummies(data,columns=['sx','rk','dg'],drop_first=True)
data2.head()

   yr  yd     sl  sx_male  rk_associate  rk_full  dg_masters
0  25  35  36350        1             0        1           0
1  13  22  35350        1             0        1           0
2  10  23  28200        1             0        1           0
3   7  27  26775        0             0        1           0
4  19  30  33696        1             0        1           1

In [ ]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
columnTransformer = ColumnTransformer([('encoder',OneHotEncoder(),[0,1,3])],remainder='passthrough')
data3 = np.array(columnTransformer.fit_transform(data), dtype = str)
print(data3[:5])

[['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '25.0' '35.0' '36350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '13.0' '22.0' '35350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '10.0' '23.0' '28200.0']
 ['1.0' '0.0' '0.0' '0.0' '1.0' '1.0' '0.0' '7.0' '27.0' '26775.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '0.0' '1.0' '19.0' '30.0' '33696.0']]